{
  "nav": {
    "home": "Startseite",
    "services": "Leistungen",
    "about": "Über mich",
    "contact": "Kontakt"
  },
  "home": {
    "headline": "Hallo, ich bin Timo Achtelik",
    "subline": "Freelancer für Webentwicklung & technische Beratung",
    "skills": {
      "headline": "Fähigkeiten"
    }
  },
  "services": {
    "title": "Leistungen",
    "webdev": {
      "title": "Moderne Webentwicklung",
      "description": "Moderne, responsive Webanwendungen mit Vue.js, React und anderen zukunftsweisenden Technologien. Leistungsoptimierte und nutzerorientierte Lösungen für Unternehmen jeder Größe.",
      "skill_spa": "Single Page Application (SPA), die ein nahtloses, desktopähnliches Benutzererlebnis bieten",
      "skill_pwa": "Progressive Web Apps (PWA)",
      "skill_responsiveDesign": "Responsive & Mobile-First Design",
      "skill_performance": "Performance-Optimierung"
    },
    "consulting": {
      "title": "Technische Projektberatung",
      "description": "Strategische technische Beratung für Ihre Projekte. Von der Architekturplanung bis zu Implementierungsstrategien helfe ich Ihnen, fundierte technische Entscheidungen zu treffen.",
      "skill_architecture_planning": "Technische Architekturplanung",
      "skill_codeQA": "Code-Reviews & Qualitätssicherung",
      "skill_stackSelection": "Auswahl der Technologie-Stack",
      "skill_developerTraining": "Entwickler-Training & Mentoring"
    },
    "uiux": {
      "title": "UI/UX Design",
      "description": "Nutzerzentriertes Design, das nicht nur schön aussieht, sondern auch ein außergewöhnliches Benutzererlebnis bietet. Intuitive Schnittstellen, die ansprechen und überzeugen.",
      "skill_uiDesign": "User Interface (UI) Design",
      "skill_uxResearch": "User Experience (UX) Research",
      "skill_seoOptimization": "SEO (Suchmaschinenoptimierung)",
      "skill_uiTesting": "Usability-Tests"
    },
    "performance": {
      "title": "Performance-Optimierung",
      "description": "Steigern Sie die Geschwindigkeit und Effizienz Ihrer Website. Schnellere Ladezeiten, reibungslosere Interaktionen und optimierter Code für bessere Benutzererfahrung und SEO.",
      "skill_web": "Web Vitals Optimierung",
      "skill_asset": "Asset-Optimierung",
      "skill_caching": "Caching-Strategien",
      "skill_mentoring": "Performance-Monitoring"
    }
  },
  "contact": {
    "title": "Kontakt",
    "description": "Haben Sie Fragen oder ein Projekt? Schreiben Sie mir eine Nachricht und ich melde mich so schnell wie möglich bei Ihnen.",
    "button_text": "Kontaktieren Sie mich",
    "email": "E-Mail",
    "emailDescription": "Für direkte Anfragen oder Projektvorschläge:",
    "response": "Antwortzeit",
    "responseDescription": "Ich antworte in der Regel innerhalb von 24 Stunden an Werktagen.",
    "formTitle": "Kontaktformular",
    "name": "Name",
    "namePlaceholder": "Ihr Name",
    "emailPlaceholder": "ihre-email@example.com",
    "subject": "Betreff",
    "subjectPlaceholder": "Betreff Ihrer Nachricht",
    "message": "Nachricht",
    "messagePlaceholder": "Ihre Nachricht...",
    "send": "Nachricht senden",
    "sending": "Wird gesendet...",
    "successMessage": "Vielen Dank! Ihre Nachricht wurde erfolgreich gesendet. Ich werde mich so schnell wie möglich bei Ihnen melden.",
    "errorMessage": "Es ist ein Fehler aufgetreten. Bitte versuchen Sie es später erneut oder kontaktieren Sie mich direkt per E-Mail."
  },
  "footer": {
    "description": "Professionelle Webentwicklung und technische Beratung für Ihre individuellen Projekte.",
    "links": "Links",
    "legal": "Rechtliches",
    "imprint": "Impressum",
    "privacy": "Datenschutz",
    "rights": "Alle Rechte vorbehalten."
  },
   "about": {
    "title": "Über mich",
    "intro": {
      "title": "Mein Weg zum Code",
      "content1": "Schon von Kindesalter an war ich von Computern fasziniert, eine Leidenschaft, die mich zu meinem Fachabitur in Informatik führte. Dort hatte ich erste Berührungen mit der Entwicklung und es hat mir von Anfang an Spaß gemacht. Diese Begeisterung ist die treibende Kraft in meiner gesamten Laufbahn, von meinem ersten Praktikum bis zu meiner heutigen Tätigkeit als freiberuflicher Entwickler.",
      "content2": "Mein Werdegang ist geprägt von Lernbereitschaft und dem Willen zu wachsen. Innerhalb eines Jahres wurde ich vom Junior zum Senior Developer befördert – ein Beweis für meine Fähigkeit, neue Technologien schnell zu meistern und Ergebnisse zu liefern. Ich bringe ein gut ausgeprägtes, modernes Skillset mit, kombiniert mit hohem Verantwortungs- und Qualitätsbewusstsein für jedes Projekt."
    },
    "experience": {
      "title": "Berufserfahrung",
      "jobs": {
        "job1": {
          "title": "Senior Software Engineer",
          "company": "BAYOOTEC GmbH",
          "period": "2024 - Heute",
          "description": "Als Senior Engineer übernehme ich die volle Verantwortung für komplexe Frontend- und Backend-Herausforderungen. Mein Fokus liegt auf dem Entwurf skalierbarer Software-Architekturen, der Sicherstellung hoher Code-Qualität durch Unit-Tests und dem Vorantreiben von Projekten in einem agilen (Scrum) Umfeld."
        },
        "job2": {
          "title": "Junior Software Engineer",
          "company": "BAYOOTEC GmbH",
          "period": "2023 - 2024",
          "description": "In meiner Rolle als Junior Full-Stack-Entwickler war ich für die Entwicklung und Wartung von Webanwendungen mit Technologien wie Vue.js, Node.js und C# verantwortlich. Ich habe aktiv zu den agilen Prozessen des Teams beigetragen und meine Fähigkeit, komplexe Probleme selbstständig zu lösen, schnell unter Beweis gestellt."
        },
        "job3": {
          "title": "Werkstudent Softwareentwicklung",
          "company": "BAYOONET AG",
          "period": "2017 - 2023",
          "description": "Über fast sieben Jahre hinweg wirkte ich an einer Vielzahl von Web- und On-Premise-Projekten mit. Diese langfristige Position ermöglichte es mir, ein vielseitiger Entwickler zu werden und verschiedenste Technologien wie C#/.NET, Vue.js, Angular.js und Kendo.UI einzusetzen, was die Grundlage für meine Full-Stack-Expertise legte."
        }
      }
    },
    "education": {
      "title": "Ausbildung & Früher Werdegang",
      "edu1": {
        "degree": "M.Sc. Informatik (Software Engineering)",
        "school": "Hochschule Darmstadt",
        "period": "2020 - 2023",
        "description": "Masterstudium mit Fokus auf fortgeschrittene Softwarearchitektur, Systementwicklung und moderne Prinzipien des Software Engineerings."
      },
      "edu2": {
        "degree": "B.Sc. Informatik (Kommunikation & Medien)",
        "school": "Hochschule Darmstadt",
        "period": "2016 - 2020",
        "description": "Bachelorstudium, das eine starke technische IT-Grundlage mit Mediengestaltung und benutzerzentrierten Kommunikationskonzepten verband. Teil des Studiums war ein Auslandssemester in Informatik an der Concordia University of Edmonton, Kanada."
      },
      "edu3": {
        "degree": "Ausbildung zum Fachinformatiker Anwendungsentwicklung",
        "school": "Sage Software GmbH",
        "period": "2014 - 2016",
        "description": "Erlangung grundlegender Fähigkeiten in der Webentwicklung mit HTML, CSS und AngularJS bei der Arbeit am Produkt 'Sage Office Online'."
      },
      "edu4": {
        "degree": "Jahrespraktikum im Bereich IT",
        "school": "Software AG",
        "period": "2012 - 2013",
        "description": "Im Rahmen meines Fachabiturs sammelte ich erste Erfahrungen in einem Großunternehmen bei der Arbeit mit Business Process Management (BPM) Software."
      }
    }
  }
}